Relation/Foundation.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Foundation</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-08-30 14:59:18 EDT"/>
<meta name="author" content="Greg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Foundation</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Relations as a Foundation for Mathematics </a>
<ul>
<li><a href="#sec-1.1">1.1 Primitive Concepts </a></li>
<li><a href="#sec-1.2">1.2 Sets </a></li>
<li><a href="#sec-1.3">1.3 Three Kinds of Mathematical Meaning </a></li>
<li><a href="#sec-1.4">1.4 Mathematical Reasoning </a></li>
<li><a href="#sec-1.5">1.5 Foundations </a></li>
<li><a href="#sec-1.6">1.6 Some Theorems </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Relations as a Foundation for Mathematics </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Primitive Concepts </h3>
<div class="outline-text-3" id="text-1.1">

<p>Two primitives:
</p><ul>
<li>
<b>RELATION</b>
</li>
<li>
<b>POSSIBILITY</b>

</li>
</ul>

<p>Secondary primitive concepts will be various particular relations.
</p>
<p>
Possibility is of two kinds:
</p><ul>
<li>
Intrinsic
</li>
<li>
Extrinsic

</li>
</ul>

<p>Possibility is covered in the section on the Ontological Argument
</p>
<p>
Relations have three essential characteristics
</p><ul>
<li>
They are <b>SIMPLE</b>
</li>
<li>
They have both <b>INTRINSIC</b> and <b>EXTRINSIC PROPERTIES</b>
</li>
<li>
One of the intrinsic properties is an <b>ADICITY</b>

</li>
</ul>

<p>The intrinsic properties of a relation are what determines the
<b>KIND</b> of the relation that it is, and the extrinsic properties
determine the <b>INSTANCE</b> of that kind.
</p>
<p>
Extrinsic properties are defined by means of skew-separability:
</p>
<p>
A is <b>SKEW-SEPARABLE</b> from B if A can exist without B,
but B cannot exist without A.
</p>
<p>
If a relation R is skew-separable from another relation, S,
the R is a <b>LOWER EXTRINSIC PROPERTY</b> of S, and S is an
<b>UPPER EXTRINSIC PROPERTY</b> of R. And a property of a relation
is an <b>INTRINSIC PROPERTY</b> of that relation if the relation
and the property are inseparable.
</p>
<p>
A primitive relation which exists independently of any
mind is a <b>REAL RELATION</b>.
</p>
<p>
A primitive relation which exists within a mind is an
<b>IDEAL RELATION</b>, also called an <b>ABSTRACT IDEA</b>.
</p>
<p>
A relation which is either real or ideal is a <b>GENUINE RELATION</b>,
also called an <b>INTENSIONAL RELATION</b>. 
</p>
<p>
A subset of a Cartesian product is an <b>EXTENSIONAL RELATION</b>
</p>
<p>
A grammatical form of words that indicates a relation is
called a <b>NOMINAL RELATION</b>; if it does not refer to either
a genuine relation or an extensional relation then it is
called a <b>PURELY NOMINAL RELATION</b>.
</p></div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Sets </h3>
<div class="outline-text-3" id="text-1.2">

<p>An <b>INTENSIONAL SET</b> is a plurality united by a relation.
</p>
<p>
A <b>MEMBER</b> of an intensional set is any one element of the
unified plurality; the relation between a member and its 
set is the relation of <b>SET-MEMBERSHIP</b>.
</p>
<p>
The <b>EXTENSION</b> of an intensional set is its plurality.
</p>
<p>
The <b>INTENSION</b> of an intensional set is the commonality of
its plurality: those properties, intrinsic or extrinsic,
possessed by all and only the members of the set; as such
the intension is an extrinsic property of each member.
</p>
<p>
The <b>FUNCTION EVERY</b> is the necessity relation which has
intensions as its arguments and intensional sets as its
values; its inverse is the <b>FUNCTION ANY</b>.
</p>
<p>
The <b>TERM SET</b> of a relation R is the intensional set
consisting of every term of R; it is symbolized by the
same letter, italic: <i>R</i>.
</p>
<p>
The <b>INTRINSIC PROPERTY SET</b> of a relation R is the 
intensional set of every upper extrinsic property of
R; it is symbolised by the same letter, in parens: (R).
</p>
<p>
The <b>EXTRINSIC PROPERTY SET</b> of a relation R is the
intensional set of every upper extrinsic property
of R. 
</p>
<p>
A <b>SET RELATION</b> is a relation having only the intrinsic
properties of an adicity and simplicity.
</p></div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Three Kinds of Mathematical Meaning </h3>
<div class="outline-text-3" id="text-1.3">

</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> Mathematical Reasoning </h3>
<div class="outline-text-3" id="text-1.4">

<p>A <b>RELATIONAL MEANING</b> is the relation that unifies an intensional set.
</p>
<p>
A <b>COMPOUNDABLE RELATION</b> is any kind of relation that has one or more
properties which are also possessed by the relation which unites a set
of instances of that kind. A <b>COMPOUND RELATION</b> is an extrinsic 
intensional set of compoundable relations, whose relational meaning
is of a kind similar to, or a superintension of, the kind of its
members.
</p>
</div>

</div>

<div id="outline-container-1.5" class="outline-3">
<h3 id="sec-1.5"><span class="section-number-3">1.5</span> Foundations </h3>
<div class="outline-text-3" id="text-1.5">

</div>

</div>

<div id="outline-container-1.6" class="outline-3">
<h3 id="sec-1.6"><span class="section-number-3">1.6</span> Some Theorems </h3>
<div class="outline-text-3" id="text-1.6">

</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Greg
<a href="mailto:greg@greg-Satellite-C855D">&lt;greg@greg-Satellite-C855D&gt;</a>
</p>
<p class="date"> Date: 2013-08-30 14:59:18 EDT</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
